'use strict';

/**
 const aqModel = {
  // question
  q: '',
  // right option code
  a: 'B',
  // options
  o: {
    A: '',
    B: '',
    C: '',
    D: '',
  },
}
 */

module.exports = [
  {
    q: '强神的家乡?',
    a: 'D',
    o: {
      A: '阿拉斯加',
      B: '北师',
      C: '东莞',
      D: '湘菜馆',
    }
  },
  {
    q: '强神的喜欢的频道?',
    a: 'A',
    o: {
      A: '湖南卫视',
      B: '东京卫视',
      C: '午夜电台',
      D: '少儿频道',
    }
  },
  {
    q: '在民间，强神有哪些尊称?',
    a: 'ABD',
    o: {
      A: '中流强',
      B: '黄克尔苏马强',
      C: '马兆丰',
      D: '强东',
    },
  },
  {
    q: '强神有哪些小成就?',
    a: 'ABCD',
    o: {
      A: '京东进入 500 强',
      B: '实验室腾飞',
      C: '湖南卫视收视第一',
      D: '中国队羽毛球队夺冠',
    },
  },
  {
    q: '强神的副业有哪些?',
    a: 'ABCD',
    o: {
      A: '羽毛球职业选手',
      B: '泳坛飞鱼',
      C: '湖南卫视收视率监控员',
      D: '中年妇女收割者',
    },
  },
  {
    q: '强神的一天主要有那几件事?',
    a: 'ABCD',
    o: {
      A: '睡觉',
      B: '点外卖',
      C: '睡午觉',
      D: '看湖南卫视',
    },
  },
  {
    q: '下面哪件事会让强神伤心💔?',
    a: 'ABCD',
    o: {
      A: '湖南卫视收视率下降',
      B: '外卖不好吃',
      C: '萌萌的小伙伴不来找强神',
      D: '实验室加班',
    },
  },
  {
    q: '强强的家族产业之一是什么💔?',
    a: 'C',
    o: {
      A: '修航天飞机',
      B: '核肥料回收',
      C: '黄焖鸡米饭',
      D: '航母保养',
    },
  },
];
